<?php

declare(strict_types=1);

/**
 * Provides mock data for color-related fakers, including:
 * - Safe (main) color names
 * - All color names
 */

return [
    'colors' => [
        'main' => [
            'فیروزه‌ای', 'سیاه', 'آبی', 'بنفش', 'خاکستری', 'سبز', 'لیمویی', 'زرشکی',
            'آبی سرمه‌ای', 'زیتونی', 'بنفش تیره', 'قرمز', 'نقره‌ای', 'سبز آبی', 'سفید', 'زرد',
        ],
        'all' => [
            'زغالی', 'آبی آسمانی', 'آبی سلطنتی', 'لاجوردی', 'نیلی', 'سبز چمنی', 'سبز ارتشی', 'سبز زمردی',
            'سبز یشمی', 'سبز خزه‌ای', 'سبز کله غازی', 'سبز لجنی', 'آبی کبود', 'آبی کاربنی', 'آبی اقیانوسی',
            'قرمز اناری', 'قرمز آلبالویی', 'قرمز گوجه‌ای', 'قرمز یاقوتی', 'صورتی چرک', 'صورتی ملایم',
            'صورتی مرجانی', 'صورتی هلویی', 'نارنجی مرجانی', 'نارنجی تیره', 'نارنجی روشن', 'بنفش یاسی',
            'بنفش ارغوانی', 'بنفش آبی', 'بنفش صورتی', 'بنفش یاقوتی', 'قهوه‌ای تیره', 'قهوه‌ای روشن',
            'کرم عسلی', 'کرم روشن', 'کرم طلایی', 'طلایی براق', 'طلایی مات', 'طلایی روشن', 'مسی براق',
            'مسی مات', 'آبی نفتی', 'سبز نعنایی', 'سبز لیمویی', 'سبز دریایی', 'آبی فیروزه‌ای', 'آبی لاجوردی',
            'صورتی ملایم', 'صورتی چرک', 'نارنجی آتشین', 'سبز ترافیکی', 'فیروزه‌ای تیره', 'فیروزه‌ای روشن',
            'لیمویی چرک', 'لیمویی تیره', 'لیمویی روشن', 'آبی اقیانوسی', 'آبی کاربنی', 'یاسی تیره', 'یاسی روشن',
            'ارکیده‌ای روشن', 'ارکیده‌ای تیره', 'قرمز گوجه‌ای', 'قرمز زرشکی', 'نارنجی فسفری', 'بنفش فسفری',
            'سبز فسفری', 'آبی بنفش', 'نیلی بنفش', 'زرشکی مات', 'زرشکی براق', 'فیروزه‌ای مات', 'فیروزه‌ای براق',
            'قرمز آجری', 'قرمز خونین', 'صورتی آدامسی', 'صورتی چرک', 'نارنجی سوخته', 'قهوه‌ای عسلی', 'قهوه‌ای خرمایی',
            'طلایی زیتونی', 'طلایی عسلی', 'مسی عسلی', 'مسی طلایی', 'بنفش دودی', 'بنفش کبود', 'آبی کبود',
            'آبی ارغوانی', 'سبز کبود', 'خاکستری زغالی', 'خاکستری دودی', 'خاکستری نقره‌ای', 'برنزی', 'زرشکی تیره',
        ],
    ],
];
