<?php

declare(strict_types=1);

/**
 * Provides mock data for payment-related fakers, including:
 * - bank names
 */

return [
    'bank_names' => ['آینده', 'اقتصاد نوین', 'ایران زمین', 'پارسیان', 'پاسارگاد', 'تجارت', 'تجارتی ایران و اروپا', 'توسعه تعاون', 'توسعه صادرات ایران', 'خاورمیانه', 'دی', 'رفاه کارگران', 'سامان', 'سپه', 'سرمایه', 'سینا', 'شهر', 'صادرات ایران', 'صنعت و معدن', 'قرض الحسنه رسالت', 'قرض الحسنه مهر ایران', 'گردشگری', 'مسکن', 'مشترک ایران-ونزوئلا', 'ملت', 'ملی ایران', 'کارآفرین', 'کشاورزی', 'پست بانک ایران'],
];
