<?php

declare(strict_types=1);

return [
    'titles' => [
        'male' => ['آقای'],
        'female' => ['خانم'],
    ],
    'first_names' => [
        'male' => [
            'امیر', 'رضا', 'محمد', 'علی', 'حسین', 'سعید', 'مهدی', 'حسن', 'حمید', 'رضوان',
            'فرهاد', 'کاوه', 'آرش', 'سامان', 'بهرام', 'شهاب', 'نیما', 'پارسا', 'رامین', 'سهراب',
            'داریوش', 'کوروش', 'نادر', 'یعقوب', 'ابراهیم', 'بنیامین', 'یونس', 'داوود', 'شایان', 'پیمان',
            'فرشید', 'فریدون', 'بهزاد', 'بهمن', 'ماهان', 'سهیل', 'کسری', 'رادین', 'سام', 'آریا',
            'سینا', 'شهنام', 'هوشنگ', 'شروین', 'رامبد', 'شهریار', 'پدرام', 'افشین', 'کیارش', 'مجید',
            'کیوان', 'فرامرز', 'جهانگیر', 'ایمان', 'آبتین', 'عادل', 'رادمهر', 'رضوان', 'خشایار', 'ایلیا',
            'محسن', 'عزیز', 'امین', 'عابد', 'سروش', 'وحید', 'علی‌رضا', 'عباس', 'جمشید', 'مازیار',
            'یوسف', 'منصور', 'عطا', 'هوشیار', 'هومن', 'سلمان', 'فاضل', 'شاهین', 'پویان', 'مهران',
            'نوید', 'سیروس', 'فرهاد', 'کیخسرو', 'ایرج', 'اشکان', 'رسول', 'عماد', 'محمود', 'حبیب',
            'عمران', 'کسری', 'بابک', 'مهرداد', 'سالار', 'کریم', 'فرزاد', 'پرویز', 'بهرنگ', 'کامران',
            'علی اکبر', 'محمد حسین', 'سید مهدی', 'امیر محمد', 'حسین علی', 'محمد رضا', 'سید محسن',
            'سید علی رضا', 'احمد رضا', 'حمید رضا', 'محمد امین', 'جواد الائمه', 'سید محمد باقر',
            'عباس علی', 'محمد طاهر', 'علی نقی', 'سید رضا', 'سعید محمد', 'علی اصغر', 'سید ابراهیم',
            'محمد تقی', 'رضا امیر', 'سید جعفر', 'سید مصطفی', 'سید احمد', 'حسن علی', 'کریم رضا',
            'علی رضا', 'محمد علی', 'امیر مهدی', 'محمد صادق', 'سید کاظم', 'سید محمود', 'سید جواد',
            'امیر رضا', 'محمد جواد', 'محمد باقر', 'سید حسن', 'سید محمد',
        ],
        'female' => [
            'الهام', 'ندا', 'سارا', 'مریم', 'زهرا', 'فاطمه', 'سپیده', 'مهتاب', 'پرستو', 'بهاره',
            'شیدا', 'فرشته', 'نگار', 'نسرین', 'نسترن', 'ملیکا', 'لیلا', 'آزاده', 'النا', 'رعنا',
            'شکیبا', 'ساناز', 'یاسمین', 'زهره', 'بهناز', 'مرجان', 'شقایق', 'پروانه', 'ریحانه', 'میترا',
            'فهیمه', 'نغمه', 'تینا', 'فرناز', 'لاله', 'ترانه', 'ناهید', 'الناز', 'ستاره', 'باران',
            'هستی', 'فریبا', 'شبنم', 'سودابه', 'مهناز', 'ماندانا', 'کتایون', 'مهسا', 'غزل', 'آرزو',
            'پریسا', 'مونا', 'سمیرا', 'پگاه', 'شبنم', 'الهه', 'بهاره', 'سیما', 'شهرزاد', 'شکوفه',
            'آتوسا', 'تهمینه', 'آناهیتا', 'نسیم', 'مهکامه', 'افسانه', 'ثریا', 'گلنار', 'نیلوفر', 'مژده',
            'زینب', 'سحر', 'صدیقه', 'مرضیه', 'هاجر', 'راضیه', 'فرزانه', 'گلرخ', 'پانته‌آ', 'رویا',
            'سیمین', 'نیره', 'آیلین', 'تارا', 'شهربانو', 'آذر', 'مینا', 'مارال', 'یگانه', 'سپیده',
            'آسمان', 'فرنوش', 'هاله', 'مهلا', 'ثنا', 'گلناز', 'ناهیده', 'سیندرلا', 'مریم السادات', 'حوریه',
            'فاطمه زهرا', 'مرضیه سادات', 'نجمه خاتون', 'فاطمه نرجس', 'دل آسا	', 'سی گل', 'گل آرا', 'تاج دخت ',
        ],
    ],
];
